export/index.html
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-03-06 Wed 11:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>nicohman</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" type="text/css" href="original.css"><link rel="stylesheet" type="text/css" href="fonts.css">
</head>
<body>
<nav class="container navbar navbar-light navbar-expand-sm"><ul class="navbar-nav mr-auto d-none d-sm-flex" style="list-style:none;padding-left: 1rem;"><li class="nav-item"><a accesskey="H" href="index.html" class="nav-link"> HOME </a></li><li class="nav-item"><a class="nav-link" href="/">about</a></li><li class="nav-item"><a class="nav-link" href="/downloads">downloads</a></li><li class="nav-item"><a class="nav-link" href="/contact">contact</a></li><li class="nav-item"><a class="nav-link" href="https://git.sr.ht/~nicohman">git</a></li></ul></nav><div class="container"><div class="row"><div id="content" class="col-md-7">
<h2>nicohman</h2>
<div id="outline-container-orgde40809" class="outline-3">
<h3 id="orgde40809">About Me</h3>
<div class="outline-text-3" id="text-orgde40809">
<p>
My name is Nico Hickman. I'm a high school senior passionate about coding and hacking, planning to
major in Computer Science in the fall.
</p>
</div>
<div id="outline-container-org9789328" class="outline-4">
<h4 id="org9789328">Programming</h4>
<div class="outline-text-4" id="text-org9789328">
<p>
I've used a variety of languages and frameworks for different projects,
including:
</p>

<ul class="org-ul">
<li>Rust for CLI and GUI applications, as well as some libraries</li>

<li>NodeJS for web servers</li>

<li>MongoDB for document storage</li>

<li>Some limited experience in C, C++, and Python.</li>

<li>Client-side web applications using both jQuery and vanilla JavaScript.</li>
</ul>

<p>
Recently, I swapped from github to <a href="https://sourcehut.org">sourcehut</a> for most of my major projects.
</p>
</div>
</div>
<div id="outline-container-org5b27807" class="outline-4">
<h4 id="org5b27807">Projects</h4>
<div class="outline-text-4" id="text-org5b27807">
<p>
Here's a list of the projects I've written that I feel are useful enough to
others to share(though I by no means claim they are all <i>optimal</i>).
</p>
</div>
<div id="outline-container-orga1cd66f" class="outline-5">
<h5 id="orga1cd66f">CLI Apps</h5>
<div class="outline-text-5" id="text-orga1cd66f">
<ul class="org-ul">
<li><a href="https://git.sr.ht/~nicohman/eidolon">eidolon</a> is a CLI tool written in Rust to manage and launch games on Linux
with minimalized bloat.</li>
<li><a href="https://git.sr.ht/~nicohman/wyvern">wyvern</a> is a Linux client for <a href="https://gog.com">GOG.com</a> that you easily download, update, and
sync the save files of games. You can also automatically claim games
provided via the GOG Connect program.</li>
<li><a href="https://git.sr.ht/~nicohman/raven">raven</a> is a Rust-based theme manager for Linux, supporting over 15
different ways to customize your rice. It also has a reasonably in-depth
wiki <a href="https://man.sr.ht/~nicohman/raven">here</a>.</li>
<li><a href="https://github.com/nicohman/usb-main">usb-main</a> is a nodejs-based tool to download, update, and burn images of
Linux distros automatically.</li>
</ul>
</div>
</div>
<div id="outline-container-org95e66ba" class="outline-5">
<h5 id="org95e66ba">Libraries</h5>
<div class="outline-text-5" id="text-org95e66ba">
<ul class="org-ul">
<li><a href="https://git.sr.ht/~nicohman/butlerd-rs">butlerd-rs</a> is a Rust library made to interface with <a href="https://itch.io">itch.io</a>'s <a href="https://github.com/itchio/butler">butler
daemon</a>.</li>
<li><a href="https://git.sr.ht/~nicohman/gogapi-rs">gogapi-rs</a> is a Rust library for making calls to the GOG web API</li>
<li><a href="https://git.sr.ht/~nicohman/ravenlib">ravenlib</a> is the library that powers raven, available separately for others
to easily build their own clients.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbb4c6c8" class="outline-5">
<h5 id="orgbb4c6c8">Excursions into the Web</h5>
<div class="outline-text-5" id="text-orgbb4c6c8">
<ul class="org-ul">
<li><a href="https://git.sr.ht/~nicohman/ravenserver">ravenserver</a> is an online server for people to share and install raven
themes from. I run an instance <a href="https://demenses.net">here</a>. Written using NodeJS, with 0
client-side JavaScript</li>
<li><a href="https://git.sr.ht/~nicohman/nicohman.demenses.net">nicohman.demenses.net</a>: this website, generated using org mode.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb679112" class="outline-5">
<h5 id="orgb679112">Graphical Apps</h5>
<div class="outline-text-5" id="text-orgb679112">
<ul class="org-ul">
<li><a href="https://git.sr.ht/~nicohman/graven">graven</a> is a graphical interface for raven, but is still in alpha.</li>
</ul>
</div>
</div>
<div id="outline-container-orgdfac2fb" class="outline-5">
<h5 id="orgdfac2fb">Games</h5>
<div class="outline-text-5" id="text-orgdfac2fb">
<ul class="org-ul">
<li><a href="https://github.com/nicohman/joust">joust</a> is a reproduction of Joust in Unity. Made as a part of the DigiPen
WANIC program, working with a team. I led the programming portion.</li>
<li><a href="https://github.com/nicohman/photon_chicken">photon chicken</a> is a re-imagining of the arcade game Tron, written in Rust
using the piston engine.</li>
</ul>
</div>
</div>
<div id="outline-container-org0aa6ff4" class="outline-5">
<h5 id="org0aa6ff4">Other</h5>
<div class="outline-text-5" id="text-org0aa6ff4">
<ul class="org-ul">
<li><a href="https://github.com/nicohman/school-alerter">school-alerter</a> is a nodejs daemon that scrapes my school's Trumba calender
and texts me every morning with what time I have to be at school that day,
depending on the class schedule that day.</li>
<li><a href="https://git.sr.ht/~nicohman/org-sourcehut">org-sourcehut</a> is a theme for the HTML exported by <a href="https://orgmode.org">Emacs' org mode</a> that
styles it like <a href="https://man.sr.ht/~nicohman/raven">man.sr.ht</a>. It is also used for this website.</li>
</ul>

<p>
This site is under the MIT License. The CSS for this website comes from
<a href="https://sourcehut.org">sourcehut</a>, where it is also distributed under the MIT license.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="table-of-contents" class="col-md-5">
<h3>Table of Contents</h3>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgde40809">About Me</a>
<ul>
<li><a href="#org9789328">Programming</a></li>
<li><a href="#org5b27807">Projects</a>
<ul>
<li><a href="#orga1cd66f">CLI Apps</a></li>
<li><a href="#org95e66ba">Libraries</a></li>
<li><a href="#orgbb4c6c8">Excursions into the Web</a></li>
<li><a href="#orgb679112">Graphical Apps</a></li>
<li><a href="#orgdfac2fb">Games</a></li>
<li><a href="#org0aa6ff4">Other</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
</div></div></body>
</html>